; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-29)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
)
)
)

; plan
1. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 6 of 29
2. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 6 of 29
3. (drop ball6 room3 left)
   deleted: (carry ball6 left)
   added: (at ball6 room3) (free left)
   goals met: 7 of 29
4. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 7 of 29
5. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 7 of 29
6. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 7 of 29
7. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 8 of 29
8. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 8 of 29
9. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 8 of 29
10. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 8 of 29
11. (drop ball8 room3 left)
   deleted: (carry ball8 left)
   added: (at ball8 room3) (free left)
   goals met: 9 of 29
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 9 of 29
13. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 9 of 29
14. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 9 of 29
15. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 10 of 29
16. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 10 of 29
17. (pick ball14 roomb left)
   deleted: (at ball14 roomb) (free left)
   added: (carry ball14 left)
   goals met: 10 of 29
18. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 10 of 29
19. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 11 of 29
20. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 11 of 29
21. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 11 of 29
22. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 11 of 29
23. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 12 of 29
24. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 12 of 29
25. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 12 of 29
26. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 12 of 29
27. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 13 of 29
28. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 13 of 29
29. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 13 of 29
30. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 13 of 29
31. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 14 of 29
32. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 14 of 29
33. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 14 of 29
34. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 14 of 29
35. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 14 of 29
36. (drop ball10 room3 left)
   deleted: (carry ball10 left)
   added: (at ball10 room3) (free left)
   goals met: 15 of 29
37. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 15 of 29
38. (pick ball29 room4 left)
   deleted: (at ball29 room4) (free left)
   added: (carry ball29 left)
   goals met: 15 of 29
39. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 15 of 29
40. (drop ball29 room3 left)
   deleted: (carry ball29 left)
   added: (at ball29 room3) (free left)
   goals met: 16 of 29
41. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 16 of 29
42. (pick ball28 room4 left)
   deleted: (at ball28 room4) (free left)
   added: (carry ball28 left)
   goals met: 16 of 29
43. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 16 of 29
44. (drop ball28 room3 left)
   deleted: (carry ball28 left)
   added: (at ball28 room3) (free left)
   goals met: 17 of 29
45. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 17 of 29
46. (pick ball27 room4 left)
   deleted: (at ball27 room4) (free left)
   added: (carry ball27 left)
   goals met: 17 of 29
47. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 17 of 29
48. (drop ball27 room3 left)
   deleted: (carry ball27 left)
   added: (at ball27 room3) (free left)
   goals met: 18 of 29
49. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 18 of 29
50. (pick ball26 room4 left)
   deleted: (at ball26 room4) (free left)
   added: (carry ball26 left)
   goals met: 18 of 29
51. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 18 of 29
52. (drop ball26 room3 left)
   deleted: (carry ball26 left)
   added: (at ball26 room3) (free left)
   goals met: 19 of 29
53. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 19 of 29
54. (pick ball25 room4 left)
   deleted: (at ball25 room4) (free left)
   added: (carry ball25 left)
   goals met: 19 of 29
55. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 19 of 29
56. (drop ball25 room3 left)
   deleted: (carry ball25 left)
   added: (at ball25 room3) (free left)
   goals met: 20 of 29
57. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 20 of 29
58. (pick ball24 room4 left)
   deleted: (at ball24 room4) (free left)
   added: (carry ball24 left)
   goals met: 20 of 29
59. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 20 of 29
60. (drop ball24 room3 left)
   deleted: (carry ball24 left)
   added: (at ball24 room3) (free left)
   goals met: 21 of 29
61. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 21 of 29
62. (pick ball23 room4 left)
   deleted: (at ball23 room4) (free left)
   added: (carry ball23 left)
   goals met: 21 of 29
63. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 21 of 29
64. (drop ball23 room3 left)
   deleted: (carry ball23 left)
   added: (at ball23 room3) (free left)
   goals met: 22 of 29
65. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 22 of 29
66. (pick ball22 room4 left)
   deleted: (at ball22 room4) (free left)
   added: (carry ball22 left)
   goals met: 22 of 29
67. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 22 of 29
68. (drop ball22 room3 left)
   deleted: (carry ball22 left)
   added: (at ball22 room3) (free left)
   goals met: 23 of 29
69. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 23 of 29
70. (pick ball21 room4 left)
   deleted: (at ball21 room4) (free left)
   added: (carry ball21 left)
   goals met: 23 of 29
71. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 23 of 29
72. (drop ball21 room3 left)
   deleted: (carry ball21 left)
   added: (at ball21 room3) (free left)
   goals met: 24 of 29
73. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 24 of 29
74. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 24 of 29
75. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 24 of 29
76. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 25 of 29
77. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 25 of 29
78. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 25 of 29
79. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 25 of 29
80. (drop ball4 room3 left)
   deleted: (carry ball4 left)
   added: (at ball4 room3) (free left)
   goals met: 26 of 29
81. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 26 of 29
82. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 26 of 29
83. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 26 of 29
84. (drop ball3 room3 left)
   deleted: (carry ball3 left)
   added: (at ball3 room3) (free left)
   goals met: 27 of 29
85. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 27 of 29
86. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 27 of 29
87. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 27 of 29
88. (drop ball2 room3 left)
   deleted: (carry ball2 left)
   added: (at ball2 room3) (free left)
   goals met: 28 of 29
89. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 28 of 29
90. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 28 of 29
91. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 28 of 29
92. (drop ball1 room3 left)
   deleted: (carry ball1 left)
   added: (at ball1 room3) (free left)
   goals met: 29 of 29
